{
  "schemaVersion": "1.0",
  "courseIdBase": "SPORT_SALES_NETWORK_EUROPE_2026",
  "courseName": "Build a Sport Sales Network in Europe 2026",
  "version": "2026-02-04",
  "language": "en",
  "metadata": {
    "regionalFocus": [
      "Europe (EU, EEA, UK)",
      "USA benchmark",
      "MENA procurement reference"
    ],
    "motions": [
      "B2C",
      "B2B",
      "B2G"
    ],
    "distribution": [
      "Direct sales",
      "Channel partners",
      "Public procurement"
    ],
    "publish": {
      "tagline": "Design, launch, and scale a three-motion sport sales network across Europe.",
      "publicDescription": "A 30-day execution course for sport, fitness, and sport-tech operators who need a governed go-to-market across B2C, B2B, and B2G in Europe. You will build motion-specific ICPs, evidence-based pipeline stages, partner governance rules, EU and UK procurement readiness packs, and a 90-day operating cadence with KPIs and risk controls.",
      "whoItsFor": [
        "Sport-tech and fitness founders and operators",
        "Commercial leaders running multi-country sales",
        "Sales and partnerships managers building channel coverage",
        "Bid and compliance leads preparing EU and UK tenders",
        "Agencies and integrators selling into sport organisations"
      ],
      "prerequisites": [
        "You know your product and your delivery model.",
        "You can name at least one target segment in sport or fitness.",
        "You can dedicate 20 to 30 minutes per day for 30 days.",
        "You can produce written artefacts (one pagers, checklists, templates)."
      ],
      "whatYouShip": [
        "Three motion one-pagers (B2C, B2B, B2G) with KPIs",
        "ICP pack with fit signals and disqualifiers",
        "Packaging and proof system (ROI and evidence checklist)",
        "Pipeline stages with exit criteria and forecast hygiene rules",
        "Partner program v1 (selection, onboarding, incentives, deal protection)",
        "EU and UK procurement readiness pack (checklists, evidence library, submission workflow)",
        "90-day operating plan with cadence, owners, KPIs, and risk playbooks"
      ],
      "useAndShareNote": "You may share the outputs publicly, but remove any confidential customer data. Replace examples with anonymised evidence. Procurement content is operational guidance only and does not replace legal advice.",
      "licenseNote": "Unless you attach a separate licence, treat this course content as proprietary to the publisher."
    }
  },
  "intent": {
    "oneSentence": "Equip operators to design, launch, and scale a three-motion sport sales network across Europe, with partner governance, EU and UK procurement readiness, and practical benchmarking against USA and MENA entry points.",
    "outcomes": [
      "Map and operate three motion-specific ICPs, packages, channels, and stage definitions that reflect European commercial, corporate, and public realities.",
      "Run an evidence-based pipeline that prevents false progress, with qualification and discovery artefacts that translate into proposals and delivery handoffs.",
      "Build a partner layer (selection, onboarding, incentives, deal protection, escalation) that scales coverage without breaking governance.",
      "Earn EU/UK procurement readiness while capturing USA and MENA lessons with compliance checklists, evidence packs, and submission workflows.",
      "Ship a 90-day operating plan with KPIs, reporting cadence, and risk playbooks that keep partners and procurement aligned."
    ],
    "nonGoals": [
      "Deep product training (this course presumes product familiarity and focuses on go-to-market execution).",
      "Tool-specific CRM certification (we cover operating patterns and governance, not vendor-specific click paths)."
    ]
  },
  "qualityGates": {
    "lessonLengthMinutes": [
      20,
      30
    ],
    "quizQuestions": 7,
    "applicationMinimum": 5,
    "criticalMinimum": 2,
    "recallAllowed": false
  },
  "concepts": {
    "valueChainMapping": "Identify who pays, decides, influences, uses, blocks, and governs purchase decisions in sport and fitness.",
    "segmentMotioning": "Treat B2C, B2B, and B2G as distinct businesses with motion-specific economics, evidence, and cadence.",
    "partnerEcosystem": "Decide direct versus partner-led coverage, then build rules for incentives, deal protection, onboarding, and escalation.",
    "procurementReadiness": "Operate a compliance-first approach for EU and UK public buyers while cataloguing USA and MENA procedures for future expansion.",
    "europeReality": "Account for European realities: multi-country coverage, language and legal variance, VAT and invoicing constraints, GDPR-driven data handling, and slower consensus cycles in federated organisations.",
    "evidenceDiscipline": "Separate activity from progress by requiring written evidence to claim stage movement, and by defining disqualification and downgrade rules.",
    "rolloutCadence": "Execute a 90-day rollout with explicit gates, KPI formulas, owners, and weekly inspection rhythms."
  },
  "procedures": [
    {
      "id": "pipelineBlueprint",
      "name": "Pipeline blueprint per motion",
      "steps": [
        "Define stages with exit criteria and the evidence required to claim stage progression.",
        "Define stage-level success metrics (conversion rate, time-in-stage, disqualification rate) and what action changes them.",
        "Define forecast hygiene rules: next step, owner, date, and mutual plan required for late stages.",
        "Enforce a downgrade rule: any deal without a dated next step is not forecastable."
      ],
      "usedInDays": [
        11,
        12,
        13,
        14,
        15
      ]
    },
    {
      "id": "partnerEnablement",
      "name": "Partner enablement system",
      "steps": [
        "Select partner types by capability and leverage, not by logo or enthusiasm.",
        "Design onboarding, certification, and playbooks that partners can execute without internal support.",
        "Define incentives with deal registration and conflict rules.",
        "Define escalation triggers, resolution timelines, and a final arbitration owner."
      ],
      "usedInDays": [
        16,
        17,
        18,
        19,
        20
      ]
    },
    {
      "id": "procurementHandoff",
      "name": "Procurement readiness handoff",
      "steps": [
        "Define which public opportunities you are eligible for and which are excluded by design.",
        "Build a compliance checklist, an evidence pack library, and a submission workflow with checkpoints.",
        "Map tender discovery sources and alerting routines for each region.",
        "Align contract terms, risk playbooks, and delivery handoffs so commitments remain executable."
      ],
      "usedInDays": [
        21,
        22,
        29
      ]
    }
  ],
  "assessmentBlueprint": {
    "midCourse": {
      "day": 15,
      "deliverable": "Pipeline model + qualification and negotiation pack",
      "evaluation": "Evidence per stage, qualification rigor, discovery quality, mutual plan presence, give-get discipline"
    },
    "final": {
      "day": 30,
      "deliverable": "Complete blueprint + 90-day operating plan",
      "evaluation": "Ability to execute: owners, gates, KPIs, partner governance, procurement readiness, risk controls"
    }
  },
  "lessons": [
    {
      "dayNumber": 1,
      "canonicalTitle": "Sport and fitness value chain map",
      "objective": "Build a buyer-reality map for a sport or fitness offer by identifying payers, economic buyers, technical buyers, champions, users, blockers, and governance functions.",
      "keyConcepts": [
        "buying committee roles (payer, economic buyer, technical buyer, users)",
        "champion versus coach versus sponsor",
        "procurement and legal as process owners",
        "seasonality and operational constraints in sport (event calendars, peak periods)",
        "risk owners: brand, safety, compliance, reputation"
      ],
      "exercise": "Choose one real offer (yours or a known sport-tech/fitness offer). Step 1: list every party who touches the deal from first contact to delivery. Step 2: assign each party a role label (payer, economic buyer, champion, user, technical evaluator, procurement, legal, finance). Step 3: write one sentence per role stating what they fear and what they want. Step 4: identify the single role that can stop the deal late and write the prevention action.",
      "deliverable": "One-page stakeholder matrix: columns = role, name or function, decision power (0 to 3), success metric, risk, required proof. Include a single paragraph: your primary champion plan and your primary blocker plan.",
      "sources": [
        "https://hbr.org/2015/03/making-the-consensus-sale",
        "https://hbr.org/2012/07/the-end-of-solution-sales"
      ]
    },
    {
      "dayNumber": 2,
      "canonicalTitle": "Segment architecture: B2C vs B2B vs B2G",
      "objective": "Separate B2C, B2B, and B2G into independent go-to-market motions with distinct success metrics, constraints, and operating rhythms.",
      "keyConcepts": [
        "B2C: adoption and retention economics",
        "B2B: multi-stakeholder consensus and procurement",
        "B2G: compliance-first and formal evaluation",
        "success definitions by motion (leading and lagging indicators)",
        "constraint mapping: legal, procurement, data, privacy"
      ],
      "exercise": "Create three motion cards. For each motion: define the buyer, the purchase trigger, the time-to-decision range, the primary proof required, and the first 3 KPIs to measure progress. Then write a one-paragraph definition of success that includes: target customer, measurable outcome, and an execution boundary (what you will not do).",
      "deliverable": "Three motion one-pagers. Each must include: ICP header, offer format, sales cycle range, top 3 objections, top 3 proof assets, top 3 KPIs with formulas.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://www.salesforce.com/sales/pipeline/stages/"
      ]
    },
    {
      "dayNumber": 3,
      "canonicalTitle": "ICP and personas per motion",
      "objective": "Build ICP portfolios that separate fit from hope, using explicit fit signals, disqualifiers, and measurable outcomes.",
      "keyConcepts": [
        "firmographics and operational fit",
        "fit signals versus nice-to-have signals",
        "hard disqualifiers",
        "outcome language and measurable impact",
        "non-ICP list to protect focus"
      ],
      "exercise": "Create 6 ICP sheets (2 per motion). For each: write the job-to-be-done, 3 measurable outcomes, 5 fit signals, 5 disqualifiers, and the first proof you would show. Then write a short 'non-ICP' list: who you will not sell to and why.",
      "deliverable": "ICP pack (6 sheets) with a single scoring rule: Fit Score = (signals met) minus (disqualifiers triggered). Include a 'walk-away' rule that triggers disqualification.",
      "sources": [
        "https://meddicc.com/meddpicc-sales-methodology-and-process",
        "https://www.huthwaiteinternational.com/spin-methodology"
      ]
    },
    {
      "dayNumber": 4,
      "canonicalTitle": "Offer packaging and pricing logic",
      "objective": "Package offers to match decision structures and risk profiles, using pilots, tiers, and governance-friendly terms.",
      "keyConcepts": [
        "pilot versus rollout packaging",
        "tiering and modular scope",
        "service levels and acceptance criteria",
        "risk controls: exit terms, data terms, brand safety",
        "price logic tied to value and delivery cost"
      ],
      "exercise": "Build a packaging table with 3 B2B tiers, 2 B2C entry tiers, and 1 public-sector compliant bundle. For each package: list inclusions, exclusions, delivery responsibilities, SLA, success criteria, and an explicit upgrade path. Then write one paragraph: how pricing changes with scale.",
      "deliverable": "Packaging table plus inclusion rules. Include a 'pilot contract' skeleton section list: scope, success criteria, timeline, data handling, brand safety, reporting, exit clause.",
      "sources": [
        "https://hbr.org/2015/03/making-the-consensus-sale",
        "https://hbr.org/2012/07/the-end-of-solution-sales"
      ]
    },
    {
      "dayNumber": 5,
      "canonicalTitle": "Proof system: outcomes, ROI, credibility",
      "objective": "Build a proof system that reduces buyer risk by turning claims into measurable outcomes and credible evidence.",
      "keyConcepts": [
        "outcome statements with baselines",
        "measurement plans and attribution",
        "case study structure (problem, intervention, result)",
        "risk reversal: pilot hypotheses",
        "credibility assets: references, third-party validation"
      ],
      "exercise": "Create one proof pack per motion. For each: write a measurable outcome statement with a baseline and a time window, define the data required to measure it, and list acceptable evidence types (screenshots, logs, third-party reports, invoices). Build a one-page case study outline.",
      "deliverable": "Proof pack outline: 3 case study shells + measurement plan. Include an evidence checklist that a buyer can audit.",
      "sources": [
        "https://hbr.org/2012/07/the-end-of-solution-sales",
        "https://meddicc.com/resources/the-science-of-sales-qualification"
      ]
    },
    {
      "dayNumber": 6,
      "canonicalTitle": "Direct vs indirect decision framework",
      "objective": "Decide which segments must be sold direct versus partner-led, based on margin, control, conflict risk, and enablement cost.",
      "keyConcepts": [
        "partner economics (margin and enablement cost)",
        "channel conflict and deal protection",
        "co-sell versus referral versus resale",
        "control versus scale trade-offs",
        "partner fit and capability gating"
      ],
      "exercise": "Take 10 target accounts and classify each: direct, partner-led, or co-sell. For each classification, write the reason in one sentence and list the minimum partner capability required (if partner-led). Define a conflict rule for when both direct and partner touch the account.",
      "deliverable": "Route-to-market decision matrix: account, route, reason, required proof, owner, conflict rule.",
      "sources": [
        "https://learn.microsoft.com/en-us/partner-center/enroll/csp-overview",
        "https://help.salesforce.com/s/articleView?id=experience.networks_leaddist_dealreg.htm&language=en_US&type=5"
      ]
    },
    {
      "dayNumber": 7,
      "canonicalTitle": "Online channel stack for sport and fitness",
      "objective": "Design a multi-channel online demand system with clear weekly activity targets and quality gates.",
      "keyConcepts": [
        "inbound versus outbound",
        "paid capture versus community pull",
        "referral loops",
        "quality gates for leads",
        "activity-to-outcome ratios"
      ],
      "exercise": "Design a 4-channel plan (choose from inbound, outbound, paid, community, marketplace, referral). For each channel: define weekly activities, the quality gate (what qualifies a lead), and the handoff rule into pipeline.",
      "deliverable": "Channel plan plus a weekly scoreboard: activity counts, qualified leads, meetings, opportunities created, conversion rate.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://meddicc.com/resources/meddicc-versus-other-qualification-frameworks-like-bant"
      ]
    },
    {
      "dayNumber": 8,
      "canonicalTitle": "Offline channel stack: venues, events, field execution",
      "objective": "Turn offline events and venues into a repeatable pipeline engine with entry and exit criteria.",
      "keyConcepts": [
        "field rhythms and calendars",
        "event-based qualification",
        "demo-to-deal conversion",
        "lead capture and attribution",
        "post-event follow-up sequencing"
      ],
      "exercise": "Build a 6-week field calendar. For each event: define target accounts, entry criteria, offer, capture method, follow-up sequence, and exit criteria.",
      "deliverable": "Offline activation plan plus a lead capture specification: required fields, consent rules, and follow-up SLA.",
      "sources": [
        "https://hbr.org/2015/03/making-the-consensus-sale",
        "https://www.salesforce.com/sales/pipeline/stages/"
      ]
    },
    {
      "dayNumber": 9,
      "canonicalTitle": "Territory and account model",
      "objective": "Design coverage that matches buying patterns using territories, account tiers, and whitespace rules.",
      "keyConcepts": [
        "territory types (geo, vertical, named accounts)",
        "account tiering",
        "whitespace analysis",
        "coverage ratios",
        "priority account plans"
      ],
      "exercise": "Draft a territory model for three European sub-regions (pick any 3: DACH, Nordics, Iberia, France, Benelux, Italy, CEE, Balkans, UK/Ireland). Assign account tiers (A/B/C) with explicit rules. For each tier, define coverage expectations per month (touchpoints, exec involvement, partner involvement) and a language or localisation note.",
      "deliverable": "Territory spec (Europe-ready) plus tiering rules and a one-page Tier A account plan template that includes: stakeholder map, procurement path (if relevant), partner role, localisation notes, and a 30-day mutual action plan.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://www.salesforce.com/sales/pipeline/stages/"
      ]
    },
    {
      "dayNumber": 10,
      "canonicalTitle": "Unit economics and channel profitability",
      "objective": "Prove that each motion and channel is economically viable with explicit assumptions.",
      "keyConcepts": [
        "CAC, LTV, payback",
        "gross margin and delivery cost",
        "partner margin waterfall",
        "churn drivers",
        "assumptions register"
      ],
      "exercise": "Build a simple model for B2C, B2B, B2G: CAC, conversion rates, retention/churn, gross margin, payback. Add an assumptions register and mark which assumptions are unproven.",
      "deliverable": "Unit economics sheet plus assumptions register and a 'kill criteria' list (what would make you stop a motion).",
      "sources": [
        "https://meddicc.com/meddpicc-sales-methodology-and-process",
        "https://www.salesforce.com/sales/pipeline/management/"
      ]
    },
    {
      "dayNumber": 11,
      "canonicalTitle": "Pipeline architecture per motion",
      "objective": "Define stages that reflect reality and force evidence before forecast commitments.",
      "keyConcepts": [
        "stage exit criteria",
        "evidence-based progression",
        "time-in-stage limits",
        "forecast categories",
        "downgrade rules"
      ],
      "exercise": "For each motion, define pipeline stages and the required evidence to move forward. Add a time-in-stage limit and a required next-step rule.",
      "deliverable": "Pipeline stage definitions pack: stage name, definition, exit criteria, required evidence, disqualify triggers.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/stages/",
        "https://www.salesforce.com/sales/pipeline/management/"
      ]
    },
    {
      "dayNumber": 12,
      "canonicalTitle": "Qualification framework for complex sport deals",
      "objective": "Qualify continuously to prevent false progress and protect delivery outcomes.",
      "keyConcepts": [
        "MEDDICC components",
        "decision process and criteria",
        "economic buyer identification",
        "champion strength",
        "competition and differentiation"
      ],
      "exercise": "Complete a MEDDICC sheet for one target account. Include: metrics with baseline, decision criteria, decision process, paper process, identified economic buyer, champion plan, competition plan.",
      "deliverable": "Qualification template plus one completed example and a disqualification rule list.",
      "sources": [
        "https://meddicc.com/meddpicc-sales-methodology-and-process",
        "https://meddicc.com/resources/meddicc-versus-other-qualification-frameworks-like-bant"
      ]
    },
    {
      "dayNumber": 13,
      "canonicalTitle": "Discovery that drives value and urgency",
      "objective": "Run discovery that quantifies impact, maps stakeholders, and produces a mutual plan.",
      "keyConcepts": [
        "SPIN questioning",
        "implication and need-payoff",
        "stakeholder alignment",
        "problem quantification",
        "mutual action plan"
      ],
      "exercise": "Write a discovery script with: situation, problem, implication, need-payoff questions. Add a short section to confirm decision process and procurement steps. Then create a mutual action plan draft.",
      "deliverable": "Discovery script plus note template that captures: pain, baseline, desired outcome, stakeholders, decision steps, next step.",
      "sources": [
        "https://www.huthwaiteinternational.com/spin-methodology",
        "https://www.huthwaiteinternational.com/blog/spin-selling-questions"
      ]
    },
    {
      "dayNumber": 14,
      "canonicalTitle": "Proposal architecture: pilot, rollout, and risk control",
      "objective": "Write proposals that are executable: success criteria, governance, and risk controls are explicit.",
      "keyConcepts": [
        "pilot hypotheses",
        "success criteria",
        "delivery responsibilities",
        "SLA and reporting",
        "exit terms"
      ],
      "exercise": "Draft a 2-page proposal skeleton: context, goals, scope, success criteria, timeline, responsibilities, reporting, commercial terms, and exit.",
      "deliverable": "Proposal skeleton plus pricing options table and a pilot success checklist.",
      "sources": [
        "https://hbr.org/2012/07/the-end-of-solution-sales",
        "https://www.salesforce.com/sales/pipeline/management/"
      ]
    },
    {
      "dayNumber": 15,
      "canonicalTitle": "Negotiation and closing mechanics",
      "objective": "Close with integrity: trade concessions for commitments and protect delivery outcomes.",
      "keyConcepts": [
        "give-get discipline",
        "walk-away line",
        "legal sequencing",
        "decision process confirmation",
        "close plan"
      ],
      "exercise": "Create a negotiation plan for one live or realistic deal. Define: non-negotiables, tradables, give-get pairs, internal approval limits, and the close plan with dated steps.",
      "deliverable": "Negotiation plan template plus one completed example and a one-page close plan.",
      "sources": [
        "https://hbr.org/2015/03/making-the-consensus-sale",
        "https://meddicc.com/meddpicc-sales-methodology-and-process"
      ]
    },
    {
      "dayNumber": 16,
      "canonicalTitle": "Partner model selection",
      "objective": "Choose partner models that amplify coverage without destroying governance.",
      "keyConcepts": [
        "reseller versus referral",
        "integrators and agencies",
        "franchises and alliances",
        "capability and coverage fit",
        "partner risk assessment"
      ],
      "exercise": "Pick 2 partner models and justify them using 5 criteria: capability, reach, credibility, conflict risk, and unit economics.",
      "deliverable": "Partner model selection memo with a go/no-go checklist.",
      "sources": [
        "https://learn.microsoft.com/en-us/partner-center/enroll/indirect-reseller-tasks-in-partner-center",
        "https://www.salesforce.com/sales/partner-relationship-management/referral-partner/"
      ]
    },
    {
      "dayNumber": 17,
      "canonicalTitle": "Partner onboarding and enablement",
      "objective": "Make partners productive quickly with a clear onboarding path and certification requirements.",
      "keyConcepts": [
        "onboarding steps",
        "certification criteria",
        "playbooks and assets",
        "support boundaries",
        "co-selling workflow"
      ],
      "exercise": "Design a 14-day onboarding plan: training, first live opportunity, certification test, and weekly checkpoints.",
      "deliverable": "Onboarding plan plus enablement checklist and partner scorecard fields.",
      "sources": [
        "https://meddicc.com/meddpicc-sales-methodology-and-process"
      ]
    },
    {
      "dayNumber": 18,
      "canonicalTitle": "Partner incentives and deal registration",
      "objective": "Create incentive and deal protection rules that prevent conflict and preserve trust.",
      "keyConcepts": [
        "deal registration",
        "tiered incentives",
        "margin waterfall",
        "conflict resolution",
        "attribution rules"
      ],
      "exercise": "Write incentive tiers and deal registration rules. Include: protection window, required evidence, and arbitration steps.",
      "deliverable": "Incentive matrix plus deal registration playbook and escalation triggers.",
      "sources": [
        "https://help.salesforce.com/s/articleView?id=experience.networks_leaddist_dealreg.htm&language=en_US&type=5",
        "https://learn.microsoft.com/en-us/partner-center/enroll/csp-overview"
      ]
    },
    {
      "dayNumber": 19,
      "canonicalTitle": "Partner-led marketing and events",
      "objective": "Coordinate partner-owned campaigns that generate qualified pipeline with clear attribution.",
      "keyConcepts": [
        "co-branded campaigns",
        "partner-owned webinars",
        "event playbooks",
        "handoff SLAs",
        "pipeline attribution"
      ],
      "exercise": "Outline one joint campaign and one event. Define: audience, offer, capture method, qualification gate, and follow-up ownership.",
      "deliverable": "Campaign and event plan plus measurement dashboard definition.",
      "sources": [
        "https://www.salesforce.com/sales/partner-relationship-management/referral-partner/"
      ]
    },
    {
      "dayNumber": 20,
      "canonicalTitle": "Field enablement and partner tools",
      "objective": "Build a partner tool stack and content library that increases conversion and reduces support load.",
      "keyConcepts": [
        "playbook library",
        "certification and renewal",
        "content map",
        "support boundaries",
        "partner KPIs"
      ],
      "exercise": "Audit existing assets and define a backlog: what must exist for partners to sell without internal help.",
      "deliverable": "Enablement roadmap plus partner portal content map and KPI list.",
      "sources": [
        "https://www.salesforce.com/sales/partner-relationship-management/referral-partner/"
      ]
    },
    {
      "dayNumber": 21,
      "canonicalTitle": "B2G fundamentals in Europe: EU public procurement logic",
      "objective": "Understand how European public-sector buying differs from commercial deals and how compliance shapes the sales motion.",
      "keyConcepts": [
        "transparency and equal treatment obligations",
        "documentation and timelines mandated by EU directives",
        "evaluation criteria and framework agreements",
        "public-sector governance: procurement, legal, and finance owners",
        "how compliance influences negotiation and delivery expectations"
      ],
      "exercise": "Map the buying roles for a municipal sport programme purchase and identify what must be proven at each step.",
      "deliverable": "B2G stakeholder map plus an EU procurement document checklist draft.",
      "sources": [
        "https://eur-lex.europa.eu/eli/dir/2014/24/oj/eng",
        "https://eur-lex.europa.eu/EN/legal-content/summary/public-procurement.html"
      ]
    },
    {
      "dayNumber": 22,
      "canonicalTitle": "EU supplier readiness: ESPD, eCertis, and eForms",
      "objective": "Build a repeatable supplier readiness pack so responses to EU tenders stay fast and compliant.",
      "keyConcepts": [
        "ESPD self-declaration and evidence mapping by country",
        "eCertis classifications and document management",
        "eForms and digital procurement notices",
        "eForms mandatory use (from October 2023) and why structured data matters",
        "financial and technical capability evidence",
        "standard declarations and references"
      ],
      "exercise": "Create a supplier readiness pack outline covering company evidence, financial capability, technical capacity, references, and standard declarations.",
      "deliverable": "EU supplier readiness checklist plus an evidence map outline.",
      "sources": [
        "https://single-market-economy.ec.europa.eu/single-market/public-procurement/digital-procurement/european-single-procurement-document-and-ecertis_en",
        "https://ec.europa.eu/tools/ecertis/",
        "https://single-market-economy.ec.europa.eu/single-market/public-procurement/digital-procurement/eforms_en"
      ]
    },
    {
      "dayNumber": 23,
      "canonicalTitle": "EU tender discovery: TED, CPV taxonomy, and monitoring cadence",
      "objective": "Learn how to find opportunities and build a monitoring routine that fits your ICP and offering.",
      "keyConcepts": [
        "TED notices and advanced search",
        "common procurement vocabulary (CPV) driven taxonomy",
        "modern alerting and weekly review rhythms",
        "eligibility filters and disqualifiers",
        "pursuit decision governance"
      ],
      "exercise": "Define a weekly tender monitoring routine and create a CPV-driven search taxonomy for your offering.",
      "deliverable": "Tender monitoring SOP plus a CPV taxonomy for your top 10 opportunity types.",
      "sources": [
        "https://ted.europa.eu/en/",
        "https://ted.europa.eu/en/advanced-search",
        "https://single-market-economy.ec.europa.eu/single-market/public-procurement/digital-procurement/common-procurement-vocabulary_en",
        "https://single-market-economy.ec.europa.eu/single-market/public-procurement/digital-procurement/public-procurement-data-space-ppds_en"
      ]
    },
    {
      "dayNumber": 24,
      "canonicalTitle": "UK public procurement entry points: Find a Tender and Contracts Finder",
      "objective": "Understand the UK notice landscape and build a practical discovery routine for UK public-sector opportunities.",
      "keyConcepts": [
        "Find a Tender notices and Contracts Finder opportunities",
        "central supplier registration and reusable supplier information",
        "keyword, category, and geography search logic",
        "bid readiness and response playbooks",
        "weekly review rhythm and pursuit governance",
        "UK regulatory change awareness (process and terminology can change over time)"
      ],
      "exercise": "Build a UK monitoring routine: (1) define 10 search terms and 5 category filters, (2) set a weekly review cadence and a go/no-go checklist, (3) define a bid evidence folder structure, and (4) write a 1-page internal workflow that assigns owners for discovery, qualification, compliance, pricing, and final submission.",
      "deliverable": "UK tender monitoring SOP plus a UK readiness delta checklist versus EU (what changes in portals, required fields, and evidence handling).",
      "sources": [
        "https://www.find-tender.service.gov.uk/",
        "https://www.gov.uk/find-tender",
        "https://www.gov.uk/contracts-finder",
        "https://supplierregistration.cabinetoffice.gov.uk/",
        "https://www.gov.uk/government/collections/transforming-public-procurement"
      ]
    },
    {
      "dayNumber": 25,
      "canonicalTitle": "Comparison module: USA and MENA procurement entry points",
      "objective": "Understand what changes when you sell public-sector in the USA and selected MENA markets, and how to plan market entry without compliance surprises.",
      "keyConcepts": [
        "supplier registration requirements across markets",
        "eligibility filters and localisation needs",
        "partner roles and alliance design in new regions",
        "opportunity discovery channels and alerting",
        "execution models that match regulation and culture"
      ],
      "exercise": "Pick one USA public-sector entry path and two MENA markets, then write a short entry plan for each covering registration, discovery, and local execution model.",
      "deliverable": "USA + MENA entry plan v1 for three markets.",
      "sources": [
        "https://sam.gov/entity-registration",
        "https://sam.gov/sites/default/files/2024-11/entity-checklist.pdf",
        "https://www.acquisition.gov/far/part-13",
        "https://portal.etimad.sa/en-us",
        "https://esupply.dubai.gov.ae/",
        "https://www.adgpg.gov.ae/",
        "https://www.ashghal.gov.qa/en/Tenders/pages/erptenders.aspx"
      ]
    },
    {
      "dayNumber": 26,
      "canonicalTitle": "CRM discipline and data standards",
      "objective": "Make reporting and forecasting audit-ready.",
      "keyConcepts": [
        "required fields per pipeline stage",
        "activity standards and hygiene rules",
        "stage evidence enforcement",
        "forecast quality gates",
        "data dictionary ownership"
      ],
      "exercise": "Define required CRM fields for each pipeline stage and each motion.",
      "deliverable": "CRM data dictionary v1.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://www.salesforce.com/ca/sales/pipeline/stages/"
      ]
    },
    {
      "dayNumber": 27,
      "canonicalTitle": "KPI system that matches the motion",
      "objective": "Measure what drives revenue, not vanity metrics.",
      "keyConcepts": [
        "win rate and cycle time per motion",
        "stage conversion and forecasting accuracy",
        "retention, expansion, and partner KPIs",
        "leading vs lagging indicator balance",
        "cadence-linked reporting"
      ],
      "exercise": "Choose 12 KPIs across the three motions, define formula, owner, and cadence.",
      "deliverable": "KPI definitions pack plus cadence calendar.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://meddicc.com/meddpicc-sales-methodology-and-process"
      ]
    },
    {
      "dayNumber": 28,
      "canonicalTitle": "Compensation and incentives for direct and channel teams",
      "objective": "Align incentives with outcomes and governance.",
      "keyConcepts": [
        "direct commission versus partner manager incentives",
        "quality gates and clawbacks",
        "conflict prevention through rules",
        "balanced scorecards",
        "compliance feedback loops"
      ],
      "exercise": "Design a simple incentive model with quality and compliance gates.",
      "deliverable": "Compensation principles memo v1.",
      "sources": [
        "https://www.salesforce.com/en-us/wp-content/uploads/sites/4/documents/legal/Agreements/alliance-agreements-and-terms/salesforce-partner-program-policies.pdf",
        "https://learn.microsoft.com/en-us/partner-center/enroll/csp-overview"
      ]
    },
    {
      "dayNumber": 29,
      "canonicalTitle": "Enablement: scripts, decks, demos, and objection handling",
      "objective": "Build a repeatable enablement system for reps and partners.",
      "keyConcepts": [
        "discovery scripts",
        "demo narratives",
        "objection library",
        "procurement compliance pack",
        "partner-focused coaching"
      ],
      "exercise": "Create a one-page talk track for each motion and a shared objection library.",
      "deliverable": "Enablement pack v1.",
      "sources": [
        "https://www.huthwaiteinternational.com/spin-methodology",
        "https://meddicc.com/meddpicc-sales-methodology-and-process"
      ]
    },
    {
      "dayNumber": 30,
      "canonicalTitle": "90-day rollout plan and operating cadence",
      "objective": "Convert the blueprint into execution with ownership and rhythm.",
      "keyConcepts": [
        "weekly cadence and pipeline reviews",
        "partner and procurement check-ins",
        "iteration loops and decision gates",
        "scorecards that trigger actions",
        "communication rhythms"
      ],
      "exercise": "Plan 13 weeks with weekly targets, owners, and decision points.",
      "deliverable": "90-day rollout plan plus governance calendar.",
      "sources": [
        "https://www.salesforce.com/sales/pipeline/management/",
        "https://hbr.org/2015/03/making-the-consensus-sale"
      ]
    }
  ],
  "assessmentPlan": {
    "midCourse": {
      "day": 15,
      "deliverable": "Pipeline + qualification pack (MEDDICC + SPIN + close plan)",
      "gate": "Instructor or admin review for evidence and execution quality"
    },
    "final": {
      "day": 30,
      "deliverable": "Full blueprint + 90-day plan",
      "gate": "Executive review and approval of KPIs, partner rules, and procurement readiness"
    }
  }
}